JmeterExample/Creating DashBoards/DashBoardReports/index.html/statistics.json
{
  "JAVA" : {
    "transaction" : "JAVA",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 0.44000000000000117,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 11.970000000000027,
    "throughput" : 2.8431909131618416,
    "receivedKBytesPerSec" : 6.008462046955297,
    "sentKBytesPerSec" : 0.0
  },
  "JAVASCRIPT" : {
    "transaction" : "JAVASCRIPT",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 0.19000000000000017,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 2.8433323855558714,
    "receivedKBytesPerSec" : 6.0087610179129936,
    "sentKBytesPerSec" : 0.0
  },
  "FROMULAS-0" : {
    "transaction" : "FROMULAS-0",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 895.4150000000005,
    "medianResTime" : 768.5,
    "minResTime" : 294.0,
    "maxResTime" : 3638.0,
    "pct1ResTime" : 1400.7,
    "pct2ResTime" : 1854.4499999999996,
    "pct3ResTime" : 3463.6100000000006,
    "throughput" : 2.0376974019358127,
    "receivedKBytesPerSec" : 0.7561767702496179,
    "sentKBytesPerSec" : 0.27660150280183393
  },
  "NEW" : {
    "transaction" : "NEW",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 330.8175,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 11863.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 11856.99,
    "throughput" : 2.843251542463962,
    "receivedKBytesPerSec" : 6.0357454472434675,
    "sentKBytesPerSec" : 0.0
  },
  "FROMULAS-1" : {
    "transaction" : "FROMULAS-1",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 998.4825000000004,
    "medianResTime" : 795.0,
    "minResTime" : 303.0,
    "maxResTime" : 8650.0,
    "pct1ResTime" : 1821.800000000002,
    "pct2ResTime" : 2709.7999999999997,
    "pct3ResTime" : 4219.880000000001,
    "throughput" : 2.0699219639419595,
    "receivedKBytesPerSec" : 46.817834577011446,
    "sentKBytesPerSec" : 0.28906136801142596
  },
  "CATS" : {
    "transaction" : "CATS",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 0.1575,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 9.061459348028,
    "receivedKBytesPerSec" : 19.18480846340303,
    "sentKBytesPerSec" : 0.0
  },
  "Practice test login excercise" : {
    "transaction" : "Practice test login excercise",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 3067.23,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 87714.0,
    "pct1ResTime" : 16513.000000000175,
    "pct2ResTime" : 27963.75,
    "pct3ResTime" : 79814.44000000035,
    "throughput" : 1.7930304904834908,
    "receivedKBytesPerSec" : 3.9865511506773172,
    "sentKBytesPerSec" : 0.0
  },
  "Practice Test Exception" : {
    "transaction" : "Practice Test Exception",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 2034.4750000000026,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 28263.0,
    "pct1ResTime" : 14320.000000000542,
    "pct2ResTime" : 18017.0,
    "pct3ResTime" : 25492.480000000003,
    "throughput" : 2.0814903470885158,
    "receivedKBytesPerSec" : 4.617900166519228,
    "sentKBytesPerSec" : 0.0
  },
  "VITAMINS&SUPPLEMENTS" : {
    "transaction" : "VITAMINS&SUPPLEMENTS",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 0.22,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 2.8433121743519023,
    "receivedKBytesPerSec" : 6.019824994135668,
    "sentKBytesPerSec" : 0.0
  },
  "CURRENCYCONVERTER" : {
    "transaction" : "CURRENCYCONVERTER",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1811.2650000000003,
    "medianResTime" : 1582.0,
    "minResTime" : 673.0,
    "maxResTime" : 10762.0,
    "pct1ResTime" : 2714.800000000002,
    "pct2ResTime" : 3578.6,
    "pct3ResTime" : 6497.420000000004,
    "throughput" : 2.0830295581894305,
    "receivedKBytesPerSec" : 41.04829438935989,
    "sentKBytesPerSec" : 0.6143309829816486
  },
  "Practice" : {
    "transaction" : "Practice",
    "sampleCount" : 400,
    "errorCount" : 392,
    "errorPct" : 98.0,
    "meanResTime" : 2746.8024999999952,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 32449.0,
    "pct1ResTime" : 16514.700000000004,
    "pct2ResTime" : 22035.499999999953,
    "pct3ResTime" : 28491.99,
    "throughput" : 1.4987841113896352,
    "receivedKBytesPerSec" : 6.907605433607611,
    "sentKBytesPerSec" : 0.004010418423054297
  },
  "Courses" : {
    "transaction" : "Courses",
    "sampleCount" : 400,
    "errorCount" : 394,
    "errorPct" : 98.5,
    "meanResTime" : 2972.894999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 70030.0,
    "pct1ResTime" : 16881.800000000025,
    "pct2ResTime" : 22937.0,
    "pct3ResTime" : 39983.85000000001,
    "throughput" : 1.5493366902294954,
    "receivedKBytesPerSec" : 6.992074023191633,
    "sentKBytesPerSec" : 0.003086569187566573
  },
  "INDEX-1" : {
    "transaction" : "INDEX-1",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2417.120000000001,
    "medianResTime" : 844.0,
    "minResTime" : 298.0,
    "maxResTime" : 48008.0,
    "pct1ResTime" : 2638.4000000000015,
    "pct2ResTime" : 13734.349999999948,
    "pct3ResTime" : 47590.11,
    "throughput" : 1.5287714792392835,
    "receivedKBytesPerSec" : 72.02991949107196,
    "sentKBytesPerSec" : 0.20005408029107807
  },
  "INDEX-0" : {
    "transaction" : "INDEX-0",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6105.927499999994,
    "medianResTime" : 774.5,
    "minResTime" : 302.0,
    "maxResTime" : 162195.0,
    "pct1ResTime" : 2177.1000000000004,
    "pct2ResTime" : 60297.89999999932,
    "pct3ResTime" : 159998.43,
    "throughput" : 0.9462416464604648,
    "receivedKBytesPerSec" : 0.3428277840203442,
    "sentKBytesPerSec" : 0.1201283340233012
  },
  "DOGS" : {
    "transaction" : "DOGS",
    "sampleCount" : 400,
    "errorCount" : 397,
    "errorPct" : 99.25,
    "meanResTime" : 854.3524999999997,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 74900.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 64077.92000000001,
    "throughput" : 4.074564530915758,
    "receivedKBytesPerSec" : 8.723278576067026,
    "sentKBytesPerSec" : 0.005222525338698177
  },
  "HOME-0" : {
    "transaction" : "HOME-0",
    "sampleCount" : 430,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2983.188372093024,
    "medianResTime" : 775.5,
    "minResTime" : 297.0,
    "maxResTime" : 56089.0,
    "pct1ResTime" : 2988.8000000000043,
    "pct2ResTime" : 23867.749999999996,
    "pct3ResTime" : 46313.73999999999,
    "throughput" : 0.822524154473862,
    "receivedKBytesPerSec" : 0.293072798408894,
    "sentKBytesPerSec" : 0.09719279559700908
  },
  "HOME-1" : {
    "transaction" : "HOME-1",
    "sampleCount" : 430,
    "errorCount" : 41,
    "errorPct" : 9.5348835,
    "meanResTime" : 10667.02325581395,
    "medianResTime" : 1168.5,
    "minResTime" : 296.0,
    "maxResTime" : 186963.0,
    "pct1ResTime" : 31650.400000000005,
    "pct2ResTime" : 35972.7,
    "pct3ResTime" : 183005.91,
    "throughput" : 0.8247770704302075,
    "receivedKBytesPerSec" : 34.772645869856895,
    "sentKBytesPerSec" : 0.09108099802341217
  },
  "INDEX" : {
    "transaction" : "INDEX",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8523.187499999998,
    "medianResTime" : 1687.5,
    "minResTime" : 649.0,
    "maxResTime" : 209978.0,
    "pct1ResTime" : 4399.500000000002,
    "pct2ResTime" : 77293.7499999992,
    "pct3ResTime" : 207781.71,
    "throughput" : 0.9448781697709852,
    "receivedKBytesPerSec" : 44.861412947193124,
    "sentKBytesPerSec" : 0.24360140314408213
  },
  "Home" : {
    "transaction" : "Home",
    "sampleCount" : 400,
    "errorCount" : 392,
    "errorPct" : 98.0,
    "meanResTime" : 2716.0150000000003,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 30328.0,
    "pct1ResTime" : 17004.9,
    "pct2ResTime" : 18509.1,
    "pct3ResTime" : 27963.0,
    "throughput" : 1.464541616780718,
    "receivedKBytesPerSec" : 7.010577651827199,
    "sentKBytesPerSec" : 0.003661354041951795
  },
  "OFFERS" : {
    "transaction" : "OFFERS",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 3307.252500000002,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 120328.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 10098.14999999988,
    "pct3ResTime" : 118649.02000000002,
    "throughput" : 2.622263012980202,
    "receivedKBytesPerSec" : 5.6507399186279015,
    "sentKBytesPerSec" : 0.005608160154713518
  },
  "CURRENCYCONVERTER-1" : {
    "transaction" : "CURRENCYCONVERTER-1",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 910.8250000000003,
    "medianResTime" : 757.0,
    "minResTime" : 299.0,
    "maxResTime" : 8972.0,
    "pct1ResTime" : 1368.3000000000009,
    "pct2ResTime" : 1935.0499999999997,
    "pct3ResTime" : 4061.850000000005,
    "throughput" : 2.0931120913852737,
    "receivedKBytesPerSec" : 40.44979997697577,
    "sentKBytesPerSec" : 0.312740380841745
  },
  "CURRENCYCONVERTER-0" : {
    "transaction" : "CURRENCYCONVERTER-0",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 900.3449999999998,
    "medianResTime" : 773.0,
    "minResTime" : 300.0,
    "maxResTime" : 5421.0,
    "pct1ResTime" : 1429.0,
    "pct2ResTime" : 2044.3999999999996,
    "pct3ResTime" : 3377.1400000000026,
    "throughput" : 2.0887619385799554,
    "receivedKBytesPerSec" : 0.7955245664513501,
    "sentKBytesPerSec" : 0.30393118051602863
  },
  "DATA sCIENCE-0" : {
    "transaction" : "DATA sCIENCE-0",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 106280.0,
    "medianResTime" : 108104.0,
    "minResTime" : 98643.0,
    "maxResTime" : 108476.0,
    "pct1ResTime" : 108476.0,
    "pct2ResTime" : 108476.0,
    "pct3ResTime" : 108476.0,
    "throughput" : 0.0381927204674789,
    "receivedKBytesPerSec" : 0.016821207940266585,
    "sentKBytesPerSec" : 0.0060422077302066226
  },
  "DATA sCIENCE-1" : {
    "transaction" : "DATA sCIENCE-1",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 10681.2,
    "medianResTime" : 10798.0,
    "minResTime" : 8694.0,
    "maxResTime" : 11853.0,
    "pct1ResTime" : 11853.0,
    "pct2ResTime" : 11853.0,
    "pct3ResTime" : 11853.0,
    "throughput" : 0.12205839273508445,
    "receivedKBytesPerSec" : 0.34109599282296654,
    "sentKBytesPerSec" : 0.0
  },
  "DATA sCIENCE" : {
    "transaction" : "DATA sCIENCE",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 2928.7000000000007,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 120328.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 10093.949999999879,
    "pct3ResTime" : 116375.62000000005,
    "throughput" : 2.622263012980202,
    "receivedKBytesPerSec" : 5.633941046200997,
    "sentKBytesPerSec" : 0.005185627540317294
  },
  "OFFERS-1" : {
    "transaction" : "OFFERS-1",
    "sampleCount" : 6,
    "errorCount" : 6,
    "errorPct" : 100.0,
    "meanResTime" : 10367.166666666668,
    "medianResTime" : 10799.0,
    "minResTime" : 8694.0,
    "maxResTime" : 11850.0,
    "pct1ResTime" : 11850.0,
    "pct2ResTime" : 11850.0,
    "pct3ResTime" : 11850.0,
    "throughput" : 0.5063291139240507,
    "receivedKBytesPerSec" : 1.384164029535865,
    "sentKBytesPerSec" : 0.0
  },
  "OFFERS-0" : {
    "transaction" : "OFFERS-0",
    "sampleCount" : 6,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 107847.5,
    "medianResTime" : 107988.0,
    "minResTime" : 106958.0,
    "maxResTime" : 108478.0,
    "pct1ResTime" : 108478.0,
    "pct2ResTime" : 108478.0,
    "pct3ResTime" : 108478.0,
    "throughput" : 0.053746584852420835,
    "receivedKBytesPerSec" : 0.022096984592645676,
    "sentKBytesPerSec" : 0.007663087293411564
  },
  "TRENDING" : {
    "transaction" : "TRENDING",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 0.28750000000000026,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 4.0,
    "throughput" : 2.843251542463962,
    "receivedKBytesPerSec" : 6.019696625060419,
    "sentKBytesPerSec" : 0.0
  },
  "CONVERTORS" : {
    "transaction" : "CONVERTORS",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2581.397500000002,
    "medianResTime" : 1574.0,
    "minResTime" : 621.0,
    "maxResTime" : 26104.0,
    "pct1ResTime" : 3840.800000000002,
    "pct2ResTime" : 9458.549999999985,
    "pct3ResTime" : 24309.870000000003,
    "throughput" : 1.8569757293272176,
    "receivedKBytesPerSec" : 44.68529193979685,
    "sentKBytesPerSec" : 0.5367820467586488
  },
  "CONVERTORS-0" : {
    "transaction" : "CONVERTORS-0",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1382.105000000001,
    "medianResTime" : 771.0,
    "minResTime" : 298.0,
    "maxResTime" : 14193.0,
    "pct1ResTime" : 1831.900000000001,
    "pct2ResTime" : 7423.899999999958,
    "pct3ResTime" : 13841.6,
    "throughput" : 1.8625442354255914,
    "receivedKBytesPerSec" : 0.7039107608493202,
    "sentKBytesPerSec" : 0.26555806481653943
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 14082,
    "errorCount" : 8022,
    "errorPct" : 56.96634,
    "meanResTime" : 2485.707072858958,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 239449.0,
    "pct1ResTime" : 2134.0,
    "pct2ResTime" : 5036.5499999999665,
    "pct3ResTime" : 59393.09000000005,
    "throughput" : 26.628041320548142,
    "receivedKBytesPerSec" : 279.9540461771591,
    "sentKBytesPerSec" : 2.0791025061171506
  },
  "CONVERTORS-1" : {
    "transaction" : "CONVERTORS-1",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1199.2025000000003,
    "medianResTime" : 759.5,
    "minResTime" : 306.0,
    "maxResTime" : 12202.0,
    "pct1ResTime" : 2356.0000000000023,
    "pct2ResTime" : 3770.7499999999977,
    "pct3ResTime" : 10802.500000000005,
    "throughput" : 1.9852200368258317,
    "receivedKBytesPerSec" : 47.02102223942746,
    "sentKBytesPerSec" : 0.29080371633190893
  },
  "FROMULAS" : {
    "transaction" : "FROMULAS",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1893.9824999999992,
    "medianResTime" : 1595.5,
    "minResTime" : 615.0,
    "maxResTime" : 10306.0,
    "pct1ResTime" : 3185.5,
    "pct2ResTime" : 3819.1,
    "pct3ResTime" : 6515.76,
    "throughput" : 2.033439919475779,
    "receivedKBytesPerSec" : 46.74727455505793,
    "sentKBytesPerSec" : 0.5599902903243845
  },
  "FISH" : {
    "transaction" : "FISH",
    "sampleCount" : 400,
    "errorCount" : 392,
    "errorPct" : 98.0,
    "meanResTime" : 970.8499999999998,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 73441.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 6805.299999999918,
    "pct3ResTime" : 23562.950000000004,
    "throughput" : 3.6191234483008214,
    "receivedKBytesPerSec" : 7.847030113369042,
    "sentKBytesPerSec" : 0.012370050848684448
  },
  "C programming" : {
    "transaction" : "C programming",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 242.87499999999994,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 11870.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 11855.0,
    "throughput" : 2.843170703969066,
    "receivedKBytesPerSec" : 6.022718488783692,
    "sentKBytesPerSec" : 0.0
  },
  "REPTILES" : {
    "transaction" : "REPTILES",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 104.83500000000001,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 11864.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 8130.880000000075,
    "throughput" : 9.061459348028,
    "receivedKBytesPerSec" : 19.204807387354734,
    "sentKBytesPerSec" : 0.0
  },
  "HOme" : {
    "transaction" : "HOme",
    "sampleCount" : 400,
    "errorCount" : 392,
    "errorPct" : 98.0,
    "meanResTime" : 2192.3449999999984,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 63980.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 8268.8499999999,
    "pct3ResTime" : 63673.950000000004,
    "throughput" : 3.3433913690351806,
    "receivedKBytesPerSec" : 7.30051054631015,
    "sentKBytesPerSec" : 0.009468588838087915
  },
  "HOME" : {
    "transaction" : "HOME",
    "sampleCount" : 1200,
    "errorCount" : 811,
    "errorPct" : 67.583336,
    "meanResTime" : 5170.036666666664,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 239449.0,
    "pct1ResTime" : 3134.100000000001,
    "pct2ResTime" : 32238.550000001,
    "pct3ResTime" : 190377.7900000004,
    "throughput" : 2.2925876819263853,
    "receivedKBytesPerSec" : 38.03810249383389,
    "sentKBytesPerSec" : 0.18779330495141622
  }
}